<template>
  <v-container class="grey lighten-5 base-width my-4 px-0">
    <v-row no-gutters>
      <v-col cols="12" sm="4" md="3">
        <!--コンポーネントにする エリア選択-->

        <v-card class="pa-2" outlined tile>test1</v-card>
        <v-card class="pa-2" outlined tile>test2</v-card>
        <!---->
      </v-col>
      <v-col cols="12" sm="8" md="9">
        <v-container class="grey lighten-1 pt-0">
          <div>
            <h3>検索結果</h3>
            <p>999件(仮)</p>
          </div>
          <v-row>
            <v-col v-for="(office, i) in offices" :key="i" cols="12" md="6">
              <officeCard :office="office" />
            </v-col>
          </v-row>
        </v-container>
      </v-col>
    </v-row>
  </v-container>
</template>
<script>
export default {
  layout: 'application',
  data() {
    return {
      offices: [
        {
          id: 1,
          name: 'ああああああああああああああああああああああああ最大３０文字',
          address: '新浜松駅 徒歩５分',
          staffCount: 'スタッフ数５人',
          phone: '000-0000-0000',
          details: {
            text: 'あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
          thanks: {
            text: 'ああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
        },
        {
          id: 1,
          name: 'ああああああああああああああああああああああああ最大３０文字',
          address: '新浜松駅 徒歩５分',
          staffCount: 'スタッフ数５人',
          phone: '000-0000-0000',
          details: {
            text: 'あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
          thanks: {
            text: 'ああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
        },
        {
          id: 1,
          name: 'ああああああああああああああああああああああああ最大３０文字',
          address: '新浜松駅 徒歩５分',
          staffCount: 'スタッフ数５人',
          phone: '000-0000-0000',
          details: {
            text: 'あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
          thanks: {
            text: 'ああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
        },
        {
          id: 1,
          name: 'ああああああああああああああああああああああああ最大３０文字',
          address: '新浜松駅 徒歩５分',
          staffCount: 'スタッフ数５人',
          phone: '000-0000-0000',
          details: {
            text: 'あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
          thanks: {
            text: 'ああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
        },
        {
          id: 1,
          name: 'ああああああああああああああああああああああああ最大３０文字',
          address: '新浜松駅 徒歩５分',
          staffCount: 'スタッフ数５人',
          phone: '000-0000-0000',
          details: {
            text: 'あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
          thanks: {
            text: 'ああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
        },
        {
          id: 1,
          name: 'ああああああああああああああああああああああああ最大３０文字',
          address: '新浜松駅 徒歩５分',
          staffCount: 'スタッフ数５人',
          phone: '000-0000-0000',
          details: {
            text: 'あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
          thanks: {
            text: 'ああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
        },
        {
          id: 1,
          name: 'ああああああああああああああああああああああああ最大３０文字',
          address: '新浜松駅 徒歩５分',
          staffCount: 'スタッフ数５人',
          phone: '000-0000-0000',
          details: {
            text: 'あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
          thanks: {
            text: 'ああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
        },
        {
          id: 1,
          name: 'ああああああああああああああああああああああああ最大３０文字',
          address: '新浜松駅 徒歩５分',
          staffCount: 'スタッフ数５人',
          phone: '000-0000-0000',
          details: {
            text: 'あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
          thanks: {
            text: 'ああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
        },
        {
          id: 1,
          name: 'ああああああああああああああああああああああああ最大３０文字',
          address: '新浜松駅 徒歩５分',
          staffCount: 'スタッフ数５人',
          phone: '000-0000-0000',
          details: {
            text: 'あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
          thanks: {
            text: 'ああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
        },
        {
          id: 1,
          name: 'ああああああああああああああああああああああああ最大３０文字',
          address: '新浜松駅 徒歩５分',
          staffCount: 'スタッフ数５人',
          phone: '000-0000-0000',
          details: {
            text: 'あああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
          thanks: {
            text: 'ああああああああああああああああああああああああああああああああああああああああああああああああああ',
          },
        },
      ],
      countOdd: 0,
      countEven: 0,
    }
  },
}
</script>
<style scoped>
.base-width {
  max-width: 990px;
}
</style>
