<template>
  <v-card width="750" class="mx-auto my-6">
    <v-card-title>
      <h4 class="font-weight-bold darkgray--text pb-2">プライバシーポリシー</h4>
    </v-card-title>
    <v-card-text>
      <p class="text-body-1 font-weight-bold gray--text mb-2">
        個人情報保護方針
      </p>
      <v-form>
        <p class="text-subtitle-2 darkgray--text mb-6">
          テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①
        </p>
      </v-form>
      <div>
        <p class="text-body-1 font-weight-bold gray--text mb-2">
          タイトルタイトルタイトルタイトルタイトルタイトル
        </p>
        <p class="text-subtitle-2 darkgray--text mb-8">
          テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②
        </p>
      </div>
    </v-card-text>
  </v-card>
</template>
<script>
export default {
  layout: 'application',
  methods: {
    privacy_policy() {
      this.$router.push('/privacy_policy')
    },
  },
}
</script>
