<template>
  <v-card width="750" class="mx-auto my-6">
    <v-card-title>
      <h4 class="display-1">プライバシーポリシー</h4>
    </v-card-title>
    <v-card-text>
      <p>個人情報保護方針</p>
      <v-form>
        <p>
          テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①テキストが入ります①
        </p>
      </v-form>
      <div>
        <p>タイトルタイトルタイトルタイトルタイトルタイトル</p>
        <p>
          テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②テキストが入ります②
        </p>
      </div>
    </v-card-text>
  </v-card>
</template>
<script>
export default {
  layout: 'application',
  methods: {
    privacy_policy() {
      this.$router.push('/privacy_policy')
    },
  },
}
</script>
